# Описать словаренм, списком и множеством
# предметную область на выбор:
# автомобили, фильмы.
# Оценить удобство каждого способа.
# Объяснить, почему в конкретном случае удобен тот или иной.
# Реализовать поиск элемента.

print('======  словарь ======')
my_dict = {'car_01': 'Vaz', 'car_02': 'Gaz', 'car_03': 'Toyota', 
'car_04': 'Renault', "car_05": 'BMV'}
for i in my_dict:
    if i == 'car_04':
        print('my_dict вариант 1', my_dict[i])
if 'car_04' in my_dict:
       print('my_dict вариант 2', my_dict['car_05'])


print('======  список ======')
my_list = ['Vaz', 'Gaz', 'Toyota', 'Renault', 'BMV'] 
for k in my_list:
    if k == 'Gaz':
        print('my_list вариант 1 ...', k, ' входит в список')

if 'Vaz' in my_list:
    print('my_list вариант 2 ... элемент Vaz входит список')

if my_list.count('BMV') > 0:
     print('my_list вариант 3 ... ', k, ' входит в список')


print('======  множества ======')
my_set = set(['Vaz', 'Gaz', 'Toyota', 'Renault', 'BMV'])

if 'Vaz' in my_set:
    print('Элемент Vaz входит в множесто my_set')

""" 
Мне кажется, что словарь идеально подходит для чтения инфы из баз данных,
где получение сведений идет по ключу.
 Список тоже по своему хорош,  т.к. получать инфу можно по индексу.
 Множество это уникальный объект содержащий сведения о не повторяющихся элементах.
 Они все хороши при определенных задачах.
"""



